{
  "updated": "2026-02-10T15:55:26.736378+00:00",
  "data_range": "2026-01-28 to 2026-02-10",
  "days_analyzed": 14,
  "summary_stats": {
    "days_analyzed": 14,
    "date_range": "2026-01-28 to 2026-02-10",
    "sleep": {
      "avg_score": 81.1,
      "avg_hours": 7.6,
      "avg_deep_hours": 1.1,
      "avg_rem_hours": 1.5,
      "avg_efficiency": 83.4,
      "scores": [
        87,
        83,
        88,
        77,
        86,
        83,
        76,
        90,
        81,
        88,
        73,
        79,
        78,
        67
      ]
    },
    "readiness": {
      "avg_score": 85.6,
      "scores": [
        93,
        87,
        90,
        80,
        85,
        90,
        81,
        88,
        85,
        90,
        78,
        90,
        84,
        78
      ]
    },
    "activity": {
      "avg_score": 85.0,
      "avg_steps": 6188.2,
      "avg_calories": 537.5,
      "scores": [
        null,
        80,
        85,
        85,
        85,
        77,
        79,
        83,
        87,
        90,
        93,
        88,
        89,
        84
      ]
    },
    "heart": {
      "avg_hrv": 60.8,
      "avg_resting_hr": 47.2,
      "hrv_values": [
        null,
        69,
        55,
        76,
        61,
        60,
        50,
        72,
        52,
        56,
        69,
        62,
        55,
        53
      ]
    },
    "recovery": {
      "avg_temp_deviation": -0.1,
      "avg_breath_rate": 14.9
    },
    "workouts_count": 15
  },
  "analysis": {
    "overall_assessment": "Your metrics show strong overall performance with excellent sleep scores (81.1 average) and high readiness (85.6 average), indicating good recovery capacity. The HRV variability (ranging from 50-76 ms) and consistent resting heart rate around 46-48 bpm suggest your autonomic nervous system is responding well to your current routine.",
    "whats_going_well": [
      "Sleep quality is consistently strong with 6 out of 7 recent nights scoring 76+ and an impressive 88/100 on Feb 8th with 8 hours duration",
      "Your resting heart rate remains stable and low (46-51 bpm range) which is excellent for POTS management and indicates good cardiovascular conditioning",
      "High readiness scores (80-93 range) show your body is recovering well from activity, with 4 out of 7 days scoring 85+ indicating strong resilience"
    ],
    "areas_to_improve": [
      "Deep sleep is inconsistent, dropping to just 0.7 hours on Feb 7th versus 1.6 hours on Feb 9th - aim for more consistent sleep timing and pre-sleep routine to stabilize this critical recovery phase",
      "HRV shows significant day-to-day variation (50-76 ms range), suggesting stress or recovery inconsistency - consider stress management techniques and monitoring correlations with activity levels",
      "Activity appears uneven with step counts varying dramatically from 4,085 to 8,366 steps - establish more consistent daily movement patterns to avoid autonomic system stress from large fluctuations"
    ],
    "pots_specific_insights": "Your stable low resting heart rate and generally high HRV (60.8 ms average) suggest good autonomic regulation, which is crucial for POTS management. The correlation between higher step days and lower HRV scores (Feb 7th: 8,366 steps, HRV 76 vs Feb 4th: 8,120 steps, HRV 50) indicates you may need to monitor exercise tolerance more carefully.",
    "focus_for_next_week": "Establish a consistent sleep schedule targeting 7.5-8 hours nightly to improve deep sleep consistency, as this directly impacts autonomic nervous system regulation critical for POTS symptom management."
  }
}
