{
  "updated": "2026-02-01T15:13:43.301301+00:00",
  "data_range": "2026-01-19 to 2026-02-01",
  "days_analyzed": 14,
  "summary_stats": {
    "days_analyzed": 14,
    "date_range": "2026-01-19 to 2026-02-01",
    "sleep": {
      "avg_score": 80.4,
      "avg_hours": 7.6,
      "avg_deep_hours": 1.0,
      "avg_rem_hours": 1.6,
      "avg_efficiency": 81.4,
      "scores": [
        88,
        73,
        79,
        78,
        67,
        89,
        91,
        80,
        78,
        80,
        88,
        86,
        82,
        67
      ]
    },
    "readiness": {
      "avg_score": 79.8,
      "scores": [
        90,
        78,
        90,
        84,
        78,
        83,
        84,
        85,
        80,
        82,
        82,
        83,
        81,
        37
      ]
    },
    "activity": {
      "avg_score": 89.5,
      "avg_steps": 5203.5,
      "avg_calories": 454.0,
      "scores": [
        null,
        93,
        88,
        89,
        84,
        87,
        90,
        93,
        85,
        94,
        92,
        null,
        null,
        null
      ]
    },
    "heart": {
      "avg_hrv": 53.6,
      "avg_resting_hr": 48.4,
      "hrv_values": [
        null,
        69,
        62,
        55,
        53,
        54,
        63,
        59,
        42,
        52,
        48,
        49,
        48,
        43
      ]
    },
    "recovery": {
      "avg_temp_deviation": 0.2,
      "avg_breath_rate": 15.1
    },
    "workouts_count": 13
  },
  "analysis": {
    "overall_assessment": "Your health metrics show strong performance with an excellent average sleep score of 80.4/100 and high readiness scores averaging 79.8/100. However, there's notable variability in your deep sleep and HRV that could impact your POTS management.",
    "whats_going_well": [
      "Excellent sleep consistency with 7.6 hours average duration and strong sleep scores, including a 91/100 on Jan 26th showing your body can achieve optimal recovery",
      "Outstanding activity level with 13 workouts over 14 days and high activity scores averaging 89.5/100, demonstrating good exercise tolerance for POTS management",
      "Good HRV range with peaks of 69ms on Jan 31st and 63ms on Jan 26th, indicating your autonomic nervous system is responding well on your better days"
    ],
    "areas_to_improve": [
      "Deep sleep is inconsistent and low, ranging from just 0.3 hours on Jan 28th to 1.2 hours on Jan 26th and 31st - aim for more consistent sleep hygiene with regular bedtime routine and cooler room temperature",
      "HRV shows significant day-to-day variation (53-69ms in recent days), suggesting autonomic stress - consider stress management techniques like meditation or gentle yoga on lower HRV days",
      "Activity levels are inconsistent with step counts varying dramatically from 2,785 to 8,629 steps - try to maintain more consistent moderate activity levels to avoid POTS symptom flare-ups"
    ],
    "pots_specific_insights": "Your resting heart rate averaging 48.4 bpm is excellent for POTS management, and the correlation between your best sleep scores (89-91/100) and higher HRV (63-69ms) suggests your autonomic nervous system responds well to quality sleep. The dramatic variation in daily activity levels may be contributing to inconsistent recovery patterns.",
    "focus_for_next_week": "Establish a consistent bedtime routine to improve deep sleep quality, aiming for the 1.0+ hours you achieved on your best nights, as this appears to correlate with your higher HRV and readiness scores."
  }
}
