{
  "updated": "2026-02-04T15:31:27.825451+00:00",
  "data_range": "2026-01-22 to 2026-02-04",
  "days_analyzed": 14,
  "summary_stats": {
    "days_analyzed": 14,
    "date_range": "2026-01-22 to 2026-02-04",
    "sleep": {
      "avg_score": 81.3,
      "avg_hours": 7.6,
      "avg_deep_hours": 1.0,
      "avg_rem_hours": 1.6,
      "avg_efficiency": 82.8,
      "scores": [
        76,
        90,
        81,
        88,
        73,
        79,
        78,
        67,
        89,
        91,
        80,
        78,
        80,
        88
      ]
    },
    "readiness": {
      "avg_score": 83.6,
      "scores": [
        81,
        88,
        85,
        90,
        78,
        90,
        84,
        78,
        83,
        84,
        85,
        80,
        82,
        82
      ]
    },
    "activity": {
      "avg_score": 88.8,
      "avg_steps": 6402.1,
      "avg_calories": 550.0,
      "scores": [
        null,
        83,
        87,
        90,
        93,
        88,
        89,
        84,
        87,
        90,
        93,
        85,
        94,
        92
      ]
    },
    "heart": {
      "avg_hrv": 56.7,
      "avg_resting_hr": 47.6,
      "hrv_values": [
        null,
        72,
        52,
        56,
        69,
        62,
        55,
        53,
        54,
        63,
        59,
        42,
        52,
        48
      ]
    },
    "recovery": {
      "avg_temp_deviation": 0.0,
      "avg_breath_rate": 15.0
    },
    "workouts_count": 17
  },
  "analysis": {
    "overall_assessment": "Your health metrics show strong performance with excellent readiness (83.6 average) and activity scores (88.8 average), indicating good overall health management. However, there's notable variability in your sleep patterns and HRV readings that could be impacting your POTS management.",
    "whats_going_well": [
      "Your resting heart rate is consistently low at 47.6 bpm average, which is excellent for POTS management and indicates good cardiovascular conditioning",
      "Strong readiness scores averaging 83.6/100 suggest your body is recovering well from daily activities, with several days hitting 88-90",
      "You're maintaining high activity levels with 17 workouts in 14 days and good step counts (6,402 average), showing you're successfully staying active despite POTS"
    ],
    "areas_to_improve": [
      "Sleep consistency needs attention - you had a significant dip to 5.8 hours on Jan 31st and variable deep sleep (0.7-1.5 hours), which is crucial for autonomic nervous system regulation in POTS",
      "Deep sleep averaging only 1.0 hour is below optimal (aim for 1.5-2 hours) - consider earlier bedtime and improved sleep hygiene to support nervous system recovery",
      "HRV shows high variability (52-72 ms in recent days) indicating potential autonomic stress - monitor triggers like hydration, stress, and sleep timing that affect nervous system stability"
    ],
    "pots_specific_insights": "Your low resting heart rate and strong readiness scores suggest good POTS management, but the variable HRV (ranging 52-72 ms) and inconsistent deep sleep could be impacting your autonomic nervous system stability. The correlation between your lowest sleep duration (5.8h on Jan 31st) and corresponding readiness drop to 78 highlights how sleep directly affects your POTS symptoms.",
    "focus_for_next_week": "Prioritize sleep consistency by aiming for 7.5-8+ hours nightly with a fixed bedtime routine, as this will help stabilize your HRV and support better autonomic function for POTS management."
  }
}
