{
  "updated": "2026-01-12T22:27:09.622500+00:00",
  "data_range": "2025-12-30 to 2026-01-12",
  "days_analyzed": 14,
  "summary_stats": {
    "days_analyzed": 14,
    "date_range": "2025-12-30 to 2026-01-12",
    "sleep": {
      "avg_score": 80.4,
      "avg_hours": 5.4,
      "avg_deep_hours": 1.0,
      "avg_rem_hours": 1.3,
      "avg_efficiency": 74.9,
      "scores": [
        83,
        81,
        80,
        83,
        82,
        83,
        76,
        84,
        83,
        82,
        80,
        58,
        82,
        88
      ]
    },
    "readiness": {
      "avg_score": 80.6,
      "scores": [
        88,
        83,
        78,
        78,
        83,
        78,
        77,
        86,
        85,
        81,
        81,
        74,
        80,
        77
      ]
    },
    "activity": {
      "avg_score": 83.8,
      "avg_steps": 6068.2,
      "avg_calories": 501.4,
      "scores": [
        null,
        93,
        79,
        71,
        73,
        85,
        87,
        90,
        90,
        91,
        87,
        83,
        77,
        83
      ]
    },
    "heart": {
      "avg_hrv": 59.5,
      "avg_resting_hr": 51.0,
      "hrv_values": [
        null,
        51,
        63,
        50,
        55,
        50,
        50,
        53,
        57,
        null,
        97,
        null,
        66,
        62
      ]
    },
    "recovery": {
      "avg_temp_deviation": 0.1,
      "avg_breath_rate": 15.2
    },
    "workouts_count": 14
  },
  "analysis": {
    "overall_assessment": "Your recovery metrics are strong with an excellent average readiness score of 80.6 and good HRV at 59.5 ms, indicating your autonomic nervous system is functioning well. However, your sleep duration is significantly below optimal at just 5.4 hours average (though recent days show 7.2-7.8 hours), which is particularly concerning for POTS management where consistent, adequate sleep is crucial for autonomic stability.",
    "whats_going_well": [
      "Excellent readiness scores averaging 80.6, with recent days showing consistent 77-88 range, indicating good overall recovery capacity",
      "Strong HRV readings around 50-63 ms in recent days, suggesting your autonomic nervous system is responding well to current management strategies",
      "Consistent activity levels with 14 workouts completed and reasonable step counts (3570-8526 daily), showing you're maintaining good movement without overexertion"
    ],
    "areas_to_improve": [
      "Sleep duration needs immediate attention - while recent 7+ hour nights are excellent, the 5.4 hour average suggests earlier periods had insufficient sleep that's critical for POTS symptom management",
      "Sleep efficiency at 74.9% could be optimized through better sleep hygiene, as POTS patients need high-quality restorative sleep for autonomic regulation",
      "Deep sleep averaging only 1.0 hour is below the typical 1.5-2 hour target needed for physical recovery and autonomic nervous system restoration"
    ],
    "pots_specific_insights": "Your stable resting heart rate (47-53 bpm range) and consistent HRV suggest your POTS is well-managed currently, but the sleep deficits could trigger symptom flares if not addressed. The recent improvement to 7+ hours nightly is encouraging for maintaining autonomic stability.",
    "focus_for_next_week": "Maintain the recent 7+ hour sleep pattern consistently every night, as this appears to be supporting your strong readiness scores and stable heart rate metrics essential for POTS management"
  }
}
