{
  "updated": "2026-01-25T15:09:54.120555+00:00",
  "data_range": "2026-01-12 to 2026-01-25",
  "days_analyzed": 14,
  "summary_stats": {
    "days_analyzed": 14,
    "date_range": "2026-01-12 to 2026-01-25",
    "sleep": {
      "avg_score": 80.0,
      "avg_hours": 7.4,
      "avg_deep_hours": 1.1,
      "avg_rem_hours": 1.4,
      "avg_efficiency": 83.2,
      "scores": [
        null,
        78,
        80,
        88,
        86,
        82,
        67,
        68,
        82,
        84,
        77,
        88,
        77,
        83
      ]
    },
    "readiness": {
      "avg_score": 79.7,
      "scores": [
        null,
        80,
        82,
        82,
        83,
        81,
        37,
        77,
        87,
        92,
        83,
        85,
        79,
        88
      ]
    },
    "activity": {
      "avg_score": 89.6,
      "avg_steps": 5581.1,
      "avg_calories": 445.9,
      "scores": [
        null,
        85,
        94,
        92,
        null,
        null,
        null,
        null,
        91,
        86,
        82,
        89,
        93,
        94
      ]
    },
    "heart": {
      "avg_hrv": 52.6,
      "avg_resting_hr": 48.5,
      "hrv_values": [
        null,
        42,
        52,
        48,
        49,
        48,
        43,
        54,
        50,
        54,
        69,
        60,
        66,
        49
      ]
    },
    "recovery": {
      "avg_temp_deviation": 0.2,
      "avg_breath_rate": 15.1
    },
    "workouts_count": 12
  },
  "analysis": {
    "overall_assessment": "Your overall metrics show solid performance with an average sleep score of 80/100 and readiness of 79.7/100, indicating good recovery capacity. However, there's notable variability in your daily patterns, particularly evident in the significant dip on January 19th (readiness dropped to 37, RHR spiked to 57 bpm) followed by a recovery period.",
    "whats_going_well": [
      "Excellent sleep efficiency at 83.2% and consistent 7.4-hour average duration, providing stable foundation for POTS management",
      "Strong activity consistency with 12 workouts over 14 days and high activity scores (89.6/100 average), showing good cardiovascular conditioning",
      "Good recovery demonstrated by bounce-back from January 19th's poor metrics - readiness improved from 37 to 83 within 2 days"
    ],
    "areas_to_improve": [
      "Deep sleep is inconsistent, ranging from just 0.3h to 1.6h (January 19th vs 20th) - aim for more consistent sleep hygiene routine to stabilize this critical recovery phase",
      "HRV shows concerning variability (42-52 ms in recent days) and the January 19th episode suggests autonomic stress - consider stress management techniques and earlier bedtimes on high-stress days",
      "Step count varies dramatically (725 to 7113 steps), indicating potential boom-bust cycles - aim for more consistent daily movement between 4000-6000 steps to avoid POTS flare triggers"
    ],
    "pots_specific_insights": "The January 19th data pattern (very low HRV of 43, elevated RHR of 57, poor readiness of 37 despite long sleep) suggests a POTS flare episode, but your quick recovery within 2 days indicates good management strategies are working. Your average resting HR of 48.5 bpm is excellent for POTS, suggesting good cardiovascular conditioning.",
    "focus_for_next_week": "Prioritize consistent daily step counts between 4000-6000 to avoid the dramatic swings that may trigger POTS symptoms, while maintaining your excellent sleep duration consistency."
  }
}
