{
  "updated": "2026-01-30T15:23:23.773970+00:00",
  "data_range": "2026-01-17 to 2026-01-30",
  "days_analyzed": 14,
  "summary_stats": {
    "days_analyzed": 14,
    "date_range": "2026-01-17 to 2026-01-30",
    "sleep": {
      "avg_score": 79.6,
      "avg_hours": 7.6,
      "avg_deep_hours": 1.0,
      "avg_rem_hours": 1.5,
      "avg_efficiency": 81.5,
      "scores": [
        79,
        78,
        67,
        89,
        91,
        80,
        78,
        80,
        88,
        86,
        82,
        67,
        68,
        82
      ]
    },
    "readiness": {
      "avg_score": 79.5,
      "scores": [
        90,
        84,
        78,
        83,
        84,
        85,
        80,
        82,
        82,
        83,
        81,
        37,
        77,
        87
      ]
    },
    "activity": {
      "avg_score": 89.4,
      "avg_steps": 5248.6,
      "avg_calories": 424.7,
      "scores": [
        null,
        89,
        84,
        87,
        90,
        93,
        85,
        94,
        92,
        null,
        null,
        null,
        null,
        91
      ]
    },
    "heart": {
      "avg_hrv": 51.5,
      "avg_resting_hr": 48.4,
      "hrv_values": [
        null,
        55,
        53,
        54,
        63,
        59,
        42,
        52,
        48,
        49,
        48,
        43,
        54,
        50
      ]
    },
    "recovery": {
      "avg_temp_deviation": 0.2,
      "avg_breath_rate": 15.1
    },
    "workouts_count": 11
  },
  "analysis": {
    "overall_assessment": "Your metrics show good consistency with strong activity levels (89.4/100) and reasonable sleep scores (79.6/100), though some concerning patterns emerge around recovery. The significant HRV fluctuations (ranging from 42-63 ms over the past week) and inconsistent deep sleep suggest your autonomic nervous system may be experiencing stress.",
    "whats_going_well": [
      "Excellent activity consistency with 11 workouts completed and strong daily activity scores averaging 89.4/100, showing good cardiovascular conditioning important for POTS",
      "Sleep duration is optimal at 7.6 hours average, with your best nights (Jan 26-27) showing 8.3+ hours paired with good deep sleep above 0.9 hours",
      "Resting heart rate remains well-controlled at 48.4 bpm average, indicating your cardiovascular fitness is supporting POTS management effectively"
    ],
    "areas_to_improve": [
      "Deep sleep is concerning at only 1.0 hour average, particularly the 0.3 hour on Jan 28 - prioritize consistent bedtime routines and consider sleep environment optimization since deep sleep is crucial for autonomic recovery",
      "HRV shows high volatility (42 ms on Jan 24 jumping to 63 ms on Jan 26), suggesting you need better recovery protocols between activities to support nervous system stability",
      "Sleep efficiency at 81.5% indicates frequent wake-ups - implement POTS-friendly sleep positioning (elevated head/legs) and ensure proper hydration timing to minimize nighttime disruptions"
    ],
    "pots_specific_insights": "The HRV fluctuations combined with inconsistent deep sleep patterns suggest your autonomic nervous system is working harder to maintain balance, which is particularly challenging with POTS. Your controlled resting heart rate is encouraging, but the recovery metrics indicate you may need to adjust activity intensity based on daily readiness scores.",
    "focus_for_next_week": "Prioritize sleep consistency by maintaining the same bedtime/wake time daily and implementing a pre-sleep routine that includes electrolyte optimization and room temperature control to improve deep sleep duration and HRV stability."
  }
}
