{
  "updated": "2026-02-07T15:14:22.478952+00:00",
  "data_range": "2026-01-25 to 2026-02-07",
  "days_analyzed": 14,
  "summary_stats": {
    "days_analyzed": 14,
    "date_range": "2026-01-25 to 2026-02-07",
    "sleep": {
      "avg_score": 81.3,
      "avg_hours": 7.7,
      "avg_deep_hours": 1.0,
      "avg_rem_hours": 1.6,
      "avg_efficiency": 83.4,
      "scores": [
        77,
        86,
        83,
        76,
        90,
        81,
        88,
        73,
        79,
        78,
        67,
        89,
        91,
        80
      ]
    },
    "readiness": {
      "avg_score": 84.4,
      "scores": [
        80,
        85,
        90,
        81,
        88,
        85,
        90,
        78,
        90,
        84,
        78,
        83,
        84,
        85
      ]
    },
    "activity": {
      "avg_score": 86.5,
      "avg_steps": 6594.7,
      "avg_calories": 561.3,
      "scores": [
        null,
        85,
        77,
        79,
        83,
        87,
        90,
        93,
        88,
        89,
        84,
        87,
        90,
        93
      ]
    },
    "heart": {
      "avg_hrv": 58.9,
      "avg_resting_hr": 47.7,
      "hrv_values": [
        null,
        61,
        60,
        50,
        72,
        52,
        56,
        69,
        62,
        55,
        53,
        54,
        63,
        59
      ]
    },
    "recovery": {
      "avg_temp_deviation": -0.0,
      "avg_breath_rate": 14.9
    },
    "workouts_count": 17
  },
  "analysis": {
    "overall_assessment": "Your overall metrics show excellent performance with strong sleep (81.3/100), readiness (84.4/100), and activity scores (86.5/100). However, there's concerning day-to-day variability, particularly in HRV which ranged from 50-72ms in recent days, and some data collection issues on February 7th that need attention.",
    "whats_going_well": [
      "Excellent sleep duration averaging 7.7 hours with strong sleep scores, including your best night on Feb 3rd (90/100 with 8.3 hours)",
      "Your resting heart rate is consistently low at 47.7 bpm average, indicating good cardiovascular fitness which is beneficial for POTS management",
      "Strong activity consistency with 17 workouts over 14 days and solid daily step counts averaging 6,595 steps"
    ],
    "areas_to_improve": [
      "Deep sleep is consistently low at only 1.0 hour average - aim for 1.5-2 hours by optimizing sleep environment temperature and avoiding screens 2 hours before bed",
      "HRV shows high variability (50-72ms range in recent days) suggesting autonomic stress - focus on consistent sleep timing and stress management techniques",
      "Data collection gaps on Feb 7th indicate inconsistent ring wearing - ensure continuous monitoring for accurate POTS management insights"
    ],
    "pots_specific_insights": "Your low resting heart rate (47.7 bpm) and decent HRV (58.9ms average) suggest your autonomic nervous system is responding well to current management strategies. The variability in HRV and the correlation with sleep quality (best HRV of 72ms coincided with your highest sleep score) highlights the critical importance of consistent, quality sleep for POTS symptom control.",
    "focus_for_next_week": "Prioritize sleep consistency by maintaining the same bedtime and wake time daily, aiming for 8+ hours to improve deep sleep duration and stabilize HRV for better POTS management"
  }
}
