{
  "updated": "2026-02-15T15:14:54.204913+00:00",
  "data_range": "2026-02-02 to 2026-02-15",
  "days_analyzed": 14,
  "summary_stats": {
    "days_analyzed": 14,
    "date_range": "2026-02-02 to 2026-02-15",
    "sleep": {
      "avg_score": 82.1,
      "avg_hours": 7.6,
      "avg_deep_hours": 1.3,
      "avg_rem_hours": 1.4,
      "avg_efficiency": 85.5,
      "scores": [
        71,
        80,
        86,
        81,
        80,
        87,
        83,
        88,
        77,
        86,
        83,
        76,
        90,
        81
      ]
    },
    "readiness": {
      "avg_score": 85.1,
      "scores": [
        67,
        86,
        84,
        86,
        89,
        93,
        87,
        90,
        80,
        85,
        90,
        81,
        88,
        85
      ]
    },
    "activity": {
      "avg_score": 83.2,
      "avg_steps": 7130.1,
      "avg_calories": 615.0,
      "scores": [
        null,
        86,
        89,
        87,
        83,
        76,
        80,
        85,
        85,
        85,
        77,
        79,
        83,
        87
      ]
    },
    "heart": {
      "avg_hrv": 65.6,
      "avg_resting_hr": 47.9,
      "hrv_values": [
        null,
        75,
        73,
        68,
        72,
        70,
        69,
        55,
        76,
        61,
        60,
        50,
        72,
        52
      ]
    },
    "recovery": {
      "avg_temp_deviation": -0.1,
      "avg_breath_rate": 15.0
    },
    "workouts_count": 18
  },
  "analysis": {
    "overall_assessment": "Your health metrics show strong performance across most areas, with excellent readiness (85.1) and HRV (65.6 ms) indicating good autonomic function. However, there's a concerning dip on February 15th with sleep dropping to 71/100 and readiness falling to 67, suggesting your system may be under stress.",
    "whats_going_well": [
      "Excellent HRV averaging 65.6 ms with consistently high values (68-75 ms) in recent days, indicating strong autonomic nervous system recovery - crucial for POTS management",
      "Strong sleep efficiency at 85.5% and good sleep duration averaging 7.6 hours, providing the consistent rest your autonomic system needs",
      "Outstanding activity level with 18 workouts over 14 days and good step counts (5,027-13,316 daily), showing you're maintaining beneficial movement without overexertion"
    ],
    "areas_to_improve": [
      "Deep sleep is concerning at only 1.3 hours average, particularly the 0.8-hour dip on February 10th - aim for cooler room temperature and consistent bedtime routine to improve deep sleep recovery",
      "February 15th shows significant decline (sleep 71, readiness 67, RHR jumped to 61 from 48) - identify what changed that day and implement recovery strategies like gentle movement and hydration",
      "REM sleep at 1.4 hours is below optimal - consider limiting screen time 2 hours before bed and maintaining consistent wake times to support REM cycles"
    ],
    "pots_specific_insights": "Your consistently low resting heart rate (47.9 bpm average) and high HRV suggest your cardiovascular conditioning is helping manage POTS symptoms effectively. The February 15th spike in RHR to 61 bpm could indicate an autonomic flare - monitor for POTS symptom correlation.",
    "focus_for_next_week": "Investigate what triggered the February 15th decline in metrics and implement a consistent pre-sleep routine to improve deep sleep duration, aiming for 1.5+ hours nightly to support autonomic recovery."
  }
}
