{
  "updated": "2026-01-16T15:13:33.123198+00:00",
  "data_range": "2026-01-03 to 2026-01-16",
  "days_analyzed": 14,
  "summary_stats": {
    "days_analyzed": 14,
    "date_range": "2026-01-03 to 2026-01-16",
    "sleep": {
      "avg_score": 81.6,
      "avg_hours": 7.5,
      "avg_deep_hours": 1.2,
      "avg_rem_hours": 1.3,
      "avg_efficiency": 81.7,
      "scores": [
        84,
        77,
        88,
        77,
        83,
        81,
        80,
        83,
        82,
        83,
        76,
        84,
        83,
        82
      ]
    },
    "readiness": {
      "avg_score": 82.6,
      "scores": [
        92,
        83,
        85,
        79,
        88,
        83,
        78,
        78,
        83,
        78,
        77,
        86,
        85,
        81
      ]
    },
    "activity": {
      "avg_score": 85.9,
      "avg_steps": 6342.0,
      "avg_calories": 546.3,
      "scores": [
        null,
        82,
        89,
        93,
        94,
        93,
        79,
        71,
        73,
        85,
        87,
        90,
        90,
        91
      ]
    },
    "heart": {
      "avg_hrv": 55.8,
      "avg_resting_hr": 48.9,
      "hrv_values": [
        null,
        69,
        60,
        66,
        49,
        51,
        63,
        50,
        55,
        50,
        50,
        53,
        57,
        52
      ]
    },
    "recovery": {
      "avg_temp_deviation": 0.0,
      "avg_breath_rate": 14.8
    },
    "workouts_count": 17
  },
  "analysis": {
    "overall_assessment": "Your health metrics show excellent consistency with above-average scores across all categories - sleep (81.6/100), readiness (82.6/100), and activity (85.9/100). Your autonomic nervous system appears well-regulated with a strong average HRV of 55.8ms and consistently low resting heart rate of 48.9 bpm, which is particularly encouraging for POTS management.",
    "whats_going_well": [
      "Outstanding sleep duration consistency averaging 7.5 hours with good efficiency at 81.7%, providing crucial autonomic stability for POTS",
      "Excellent HRV variability ranging from 49-69ms showing your nervous system is adapting well to stressors and recovering effectively",
      "Impressive activity level with 17 workouts over 14 days while maintaining high readiness scores, demonstrating good exercise tolerance management"
    ],
    "areas_to_improve": [
      "Deep sleep is below optimal at only 1.2 hours average - aim for 1.5-2 hours by maintaining cooler sleep environment and consistent bedtime routine",
      "Significant step count variation (3570-8639 steps) suggests inconsistent activity pacing - consider more gradual increases to avoid POTS symptom flares",
      "Sleep score dropped on Jan 13th and 15th (both 77/100) coinciding with higher activity days, indicating need for better recovery planning after intense activity"
    ],
    "pots_specific_insights": "Your consistently low resting heart rate (48.9 bpm average) and strong HRV readings suggest your autonomic nervous system is well-managed, which is excellent for POTS control. The correlation between higher activity days and slightly lower sleep scores indicates you should monitor for delayed fatigue responses typical in POTS.",
    "focus_for_next_week": "Implement a more consistent daily step target around 5000-6000 steps to reduce the large day-to-day variations while monitoring how your sleep quality responds to this steadier activity level"
  }
}
