{
  "updated": "2026-01-23T15:15:11.873828+00:00",
  "data_range": "2026-01-10 to 2026-01-23",
  "days_analyzed": 14,
  "summary_stats": {
    "days_analyzed": 14,
    "date_range": "2026-01-10 to 2026-01-23",
    "sleep": {
      "avg_score": 80.2,
      "avg_hours": 7.5,
      "avg_deep_hours": 1.1,
      "avg_rem_hours": 1.4,
      "avg_efficiency": 82.3,
      "scores": [
        80,
        88,
        86,
        82,
        67,
        68,
        82,
        84,
        77,
        88,
        77,
        83,
        81,
        80
      ]
    },
    "readiness": {
      "avg_score": 79.8,
      "scores": [
        82,
        82,
        83,
        81,
        37,
        77,
        87,
        92,
        83,
        85,
        79,
        88,
        83,
        78
      ]
    },
    "activity": {
      "avg_score": 88.8,
      "avg_steps": 5133.4,
      "avg_calories": 397.2,
      "scores": [
        null,
        92,
        null,
        null,
        null,
        null,
        91,
        86,
        82,
        89,
        93,
        94,
        93,
        79
      ]
    },
    "heart": {
      "avg_hrv": 54.2,
      "avg_resting_hr": 48.7,
      "hrv_values": [
        null,
        48,
        49,
        48,
        43,
        54,
        50,
        54,
        69,
        60,
        66,
        49,
        51,
        63
      ]
    },
    "recovery": {
      "avg_temp_deviation": 0.2,
      "avg_breath_rate": 15.0
    },
    "workouts_count": 9
  },
  "analysis": {
    "overall_assessment": "Your health metrics show generally strong performance with an average sleep score of 80.2 and readiness score of 79.8, indicating good recovery patterns. However, January 19th stands out as a concerning day with very low deep sleep (0.3h), poor readiness (37), and elevated resting heart rate (57 bpm), suggesting a significant stress response or potential POTS flare.",
    "whats_going_well": [
      "Excellent activity consistency with 9 workouts over 14 days and strong activity scores averaging 88.8, showing you're maintaining good movement habits",
      "Your resting heart rate averages a healthy 48.7 bpm and shows good variability (45-51 bpm on most days), indicating strong cardiovascular fitness",
      "Sleep duration is consistently good at 7.5 hours average, with several nights achieving optimal deep sleep like January 20th (1.6h) and January 21st (1.5h)"
    ],
    "areas_to_improve": [
      "Deep sleep consistency needs attention - you had a concerning drop to just 0.3 hours on January 19th compared to your 1.1 hour average, impacting autonomic recovery",
      "HRV shows concerning variability, dropping to 43ms on January 19th when your average is 54.2ms, suggesting your nervous system was under significant stress",
      "The dramatic readiness drop to 37 on January 19th (versus your 79.8 average) indicates you may need better early warning recognition of POTS symptom onset"
    ],
    "pots_specific_insights": "The January 19th data pattern (low HRV, elevated RHR to 57, poor deep sleep, crashed readiness) suggests a potential POTS flare that significantly impacted your autonomic nervous system recovery. Your body showed classic signs of dysautonomia stress, but recovered well in subsequent days, indicating good overall POTS management.",
    "focus_for_next_week": "Monitor your evening routine and stress levels more closely to prevent another deep sleep crash like January 19th - consider implementing a consistent pre-sleep protocol when HRV drops below 45ms or RHR exceeds 52 bpm"
  }
}
