{
  "updated": "2026-02-06T15:29:30.586053+00:00",
  "data_range": "2026-01-24 to 2026-02-06",
  "days_analyzed": 14,
  "summary_stats": {
    "days_analyzed": 14,
    "date_range": "2026-01-24 to 2026-02-06",
    "sleep": {
      "avg_score": 81.4,
      "avg_hours": 7.6,
      "avg_deep_hours": 1.0,
      "avg_rem_hours": 1.6,
      "avg_efficiency": 82.5,
      "scores": [
        86,
        83,
        76,
        90,
        81,
        88,
        73,
        79,
        78,
        67,
        89,
        91,
        80,
        78
      ]
    },
    "readiness": {
      "avg_score": 84.4,
      "scores": [
        85,
        90,
        81,
        88,
        85,
        90,
        78,
        90,
        84,
        78,
        83,
        84,
        85,
        80
      ]
    },
    "activity": {
      "avg_score": 86.5,
      "avg_steps": 6741.5,
      "avg_calories": 549.9,
      "scores": [
        null,
        77,
        79,
        83,
        87,
        90,
        93,
        88,
        89,
        84,
        87,
        90,
        93,
        85
      ]
    },
    "heart": {
      "avg_hrv": 57.5,
      "avg_resting_hr": 47.8,
      "hrv_values": [
        null,
        60,
        50,
        72,
        52,
        56,
        69,
        62,
        55,
        53,
        54,
        63,
        59,
        42
      ]
    },
    "recovery": {
      "avg_temp_deviation": -0.0,
      "avg_breath_rate": 14.9
    },
    "workouts_count": 17
  },
  "analysis": {
    "overall_assessment": "Your health metrics show strong consistency with an excellent average sleep score of 81.4/100 and readiness score of 84.4/100, indicating good recovery patterns. However, there's notable variability in your HRV (ranging from 50-72 ms) and sleep duration fluctuations that warrant attention for optimal POTS management.",
    "whats_going_well": [
      "Excellent average resting heart rate of 47.8 bpm shows good cardiovascular conditioning, which is beneficial for POTS management",
      "Strong readiness scores averaging 84.4/100 with several days hitting 85-90, indicating your body is recovering well from daily stressors",
      "Consistent activity levels with 17 workouts over 14 days and average 6,741 steps shows you're maintaining good exercise tolerance"
    ],
    "areas_to_improve": [
      "Sleep duration inconsistency (ranging from 5.8h to 8.3h) needs stabilization - aim for consistent 7.5-8+ hours nightly as sleep regularity is crucial for autonomic nervous system stability in POTS",
      "Low deep sleep average of only 1.0 hour suggests need for better sleep optimization through consistent bedtime routine, cooler room temperature, and avoiding stimulants before bed",
      "HRV volatility (50 ms on Feb 4th vs 72 ms on Feb 3rd) indicates autonomic stress - consider stress management techniques and ensure adequate recovery between high-activity days"
    ],
    "pots_specific_insights": "Your HRV variability and sleep inconsistencies suggest your autonomic nervous system is experiencing fluctuations that could impact POTS symptoms. The correlation between your shortest sleep (5.8h on Jan 31st) and lower readiness scores indicates sleep consistency is particularly critical for your condition management.",
    "focus_for_next_week": "Establish a consistent sleep schedule aiming for 7.5-8 hours nightly with a fixed bedtime and wake time, as this will help stabilize your autonomic function and reduce HRV variability"
  }
}
