{
  "updated": "2026-01-28T15:20:36.946870+00:00",
  "data_range": "2026-01-15 to 2026-01-28",
  "days_analyzed": 14,
  "summary_stats": {
    "days_analyzed": 14,
    "date_range": "2026-01-15 to 2026-01-28",
    "sleep": {
      "avg_score": 80.1,
      "avg_hours": 7.6,
      "avg_deep_hours": 1.1,
      "avg_rem_hours": 1.5,
      "avg_efficiency": 83.2,
      "scores": [
        69,
        89,
        91,
        80,
        78,
        80,
        88,
        86,
        82,
        67,
        68,
        82,
        84,
        77
      ]
    },
    "readiness": {
      "avg_score": 79.4,
      "scores": [
        75,
        83,
        84,
        85,
        80,
        82,
        82,
        83,
        81,
        37,
        77,
        87,
        92,
        83
      ]
    },
    "activity": {
      "avg_score": 88.9,
      "avg_steps": 5618.4,
      "avg_calories": 445.8,
      "scores": [
        null,
        87,
        90,
        93,
        85,
        94,
        92,
        null,
        null,
        null,
        null,
        91,
        86,
        82
      ]
    },
    "heart": {
      "avg_hrv": 52.7,
      "avg_resting_hr": 48.3,
      "hrv_values": [
        null,
        54,
        63,
        59,
        42,
        52,
        48,
        49,
        48,
        43,
        54,
        50,
        54,
        69
      ]
    },
    "recovery": {
      "avg_temp_deviation": 0.2,
      "avg_breath_rate": 15.2
    },
    "workouts_count": 11
  },
  "analysis": {
    "overall_assessment": "Your health metrics show strong consistency with excellent activity levels (88.9/100 average) and good sleep quality (80.1/100 average). However, there's concerning variability in your HRV readings and a notable dip in performance on January 28th that warrants attention.",
    "whats_going_well": [
      "Excellent activity consistency with 11 workouts over 14 days and strong activity scores averaging 88.9/100, showing you're maintaining good movement patterns",
      "Your resting heart rate is well-controlled at 48.3 bpm average, indicating good cardiovascular conditioning which is beneficial for POTS management",
      "Sleep duration is consistently good at 7.6 hours average with decent efficiency at 83.2%, providing a solid foundation for autonomic nervous system recovery"
    ],
    "areas_to_improve": [
      "HRV shows significant variability (ranging from 42-63 ms in the last week), suggesting inconsistent autonomic recovery - focus on consistent bedtime routines and stress management",
      "Deep sleep is quite low at 1.1 hours average (should be 1.5-2 hours), which is crucial for POTS recovery - consider optimizing sleep environment temperature and avoiding screens 2 hours before bed",
      "January 28th shows a concerning pattern with poor sleep (69/100) and missing activity/HRV data - identify what triggered this decline to prevent future occurrences"
    ],
    "pots_specific_insights": "Your HRV variability (42-63 ms range) suggests your autonomic nervous system is experiencing inconsistent recovery, which is particularly important to monitor with POTS. The combination of good resting heart rate control and adequate sleep duration is positive for managing orthostatic intolerance.",
    "focus_for_next_week": "Establish a consistent pre-sleep routine starting 90 minutes before bed to improve deep sleep quality and stabilize HRV readings, as both are critical for POTS symptom management."
  }
}
