{
  "updated": "2026-02-21T15:14:04.865418+00:00",
  "data_range": "2026-02-08 to 2026-02-21",
  "days_analyzed": 14,
  "summary_stats": {
    "days_analyzed": 14,
    "date_range": "2026-02-08 to 2026-02-21",
    "sleep": {
      "avg_score": 82.1,
      "avg_hours": 7.4,
      "avg_deep_hours": 1.3,
      "avg_rem_hours": 1.5,
      "avg_efficiency": 84.8,
      "scores": [
        82,
        87,
        83,
        80,
        81,
        79,
        72,
        80,
        86,
        81,
        80,
        87,
        83,
        88
      ]
    },
    "readiness": {
      "avg_score": 84.7,
      "scores": [
        80,
        89,
        84,
        78,
        84,
        88,
        68,
        86,
        84,
        86,
        89,
        93,
        87,
        90
      ]
    },
    "activity": {
      "avg_score": 85.5,
      "avg_steps": 7543.9,
      "avg_calories": 613.9,
      "scores": [
        null,
        91,
        88,
        93,
        80,
        86,
        88,
        86,
        89,
        87,
        83,
        76,
        80,
        85
      ]
    },
    "heart": {
      "avg_hrv": 61.7,
      "avg_resting_hr": 47.7,
      "hrv_values": [
        null,
        61,
        64,
        53,
        56,
        54,
        32,
        75,
        73,
        68,
        72,
        70,
        69,
        55
      ]
    },
    "recovery": {
      "avg_temp_deviation": -0.0,
      "avg_breath_rate": 14.8
    },
    "workouts_count": 22
  },
  "analysis": {
    "overall_assessment": "Your health metrics show strong overall performance with an average sleep score of 82.1 and readiness score of 84.7, indicating good recovery patterns. However, there's notable variability in key metrics like HRV (ranging from 32-64 ms) and deep sleep (0.7-1.7h), which is particularly important for POTS management.",
    "whats_going_well": [
      "Excellent resting heart rate averaging 47.7 bpm, which is beneficial for POTS as it suggests good baseline cardiovascular fitness",
      "Strong activity levels with 22 workouts over 14 days and average activity score of 85.5, showing you're maintaining good physical conditioning",
      "Good sleep efficiency at 84.8% and consistent 7.4-hour average duration, providing a solid foundation for autonomic nervous system recovery"
    ],
    "areas_to_improve": [
      "Deep sleep shows high variability (0.7-1.7h) with some concerning low nights like Feb 19th - aim for more consistent bedtime routines to stabilize this critical recovery phase",
      "HRV dropped significantly to 32 ms on Feb 15th (half your typical range), coinciding with your lowest readiness score of 68 - monitor stress levels and recovery practices more closely on such days",
      "Sleep duration inconsistency ranges from 6.2-7.9h in the last week - establish a more regular sleep schedule as consistent timing is crucial for POTS symptom management"
    ],
    "pots_specific_insights": "Your HRV variability (32-64 ms range) is particularly significant for POTS management as it reflects autonomic nervous system stability. The correlation between your lowest HRV day (Feb 15th) and reduced readiness suggests your body is effectively signaling when additional rest is needed.",
    "focus_for_next_week": "Establish a consistent bedtime routine to stabilize your deep sleep, aiming to stay within 30 minutes of the same bedtime each night to support autonomic nervous system regulation"
  }
}
