{
  "updated": "2026-01-27T15:20:22.766438+00:00",
  "data_range": "2026-01-14 to 2026-01-27",
  "days_analyzed": 14,
  "summary_stats": {
    "days_analyzed": 14,
    "date_range": "2026-01-14 to 2026-01-27",
    "sleep": {
      "avg_score": 81.4,
      "avg_hours": 7.5,
      "avg_deep_hours": 1.1,
      "avg_rem_hours": 1.5,
      "avg_efficiency": 83.2,
      "scores": [
        89,
        91,
        80,
        78,
        80,
        88,
        86,
        82,
        67,
        68,
        82,
        84,
        77,
        88
      ]
    },
    "readiness": {
      "avg_score": 80.1,
      "scores": [
        83,
        84,
        85,
        80,
        82,
        82,
        83,
        81,
        37,
        77,
        87,
        92,
        83,
        85
      ]
    },
    "activity": {
      "avg_score": 89.1,
      "avg_steps": 5494.8,
      "avg_calories": 436.7,
      "scores": [
        null,
        90,
        93,
        85,
        94,
        92,
        null,
        null,
        null,
        null,
        91,
        86,
        82,
        89
      ]
    },
    "heart": {
      "avg_hrv": 53.2,
      "avg_resting_hr": 48.5,
      "hrv_values": [
        null,
        63,
        59,
        42,
        52,
        48,
        49,
        48,
        43,
        54,
        50,
        54,
        69,
        60
      ]
    },
    "recovery": {
      "avg_temp_deviation": 0.2,
      "avg_breath_rate": 15.1
    },
    "workouts_count": 11
  },
  "analysis": {
    "overall_assessment": "Your metrics show strong overall health management with an excellent average sleep score of 81.4/100 and good readiness scores averaging 80.1/100. However, there's notable HRV variability (ranging from 42-63ms in recent days) and some inconsistency in deep sleep duration that may impact your POTS management.",
    "whats_going_well": [
      "Excellent sleep consistency with 7.5 hour average duration and strong sleep efficiency at 83.2%, which is crucial for autonomic nervous system regulation with POTS",
      "Outstanding activity management with 11 workouts over 14 days and high activity scores averaging 89.1/100, showing you're maintaining fitness without overexertion",
      "Good resting heart rate control averaging 48.5 bpm with relatively stable values (45-54 bpm range), indicating well-managed cardiovascular baseline"
    ],
    "areas_to_improve": [
      "Address HRV volatility - your recent week shows significant swings from 42ms to 63ms, suggesting inconsistent autonomic recovery. Focus on consistent sleep/wake times and stress management",
      "Optimize deep sleep duration which averaged only 1.1 hours and dropped to 0.9 hours on Jan 24-25, below the typical 1.5-2 hour target needed for physical recovery",
      "Balance activity levels more evenly - step counts vary dramatically from 3,217 to 8,310 daily, which can trigger POTS symptoms through inconsistent orthostatic stress"
    ],
    "pots_specific_insights": "Your HRV patterns and sleep quality directly correlate with readiness scores, which is particularly important for POTS as autonomic dysfunction requires consistent nervous system recovery. The temperature deviation staying low at 0.2°C suggests good thermoregulation, which often challenges POTS patients.",
    "focus_for_next_week": "Establish a more consistent daily activity target around 5,000-6,000 steps to avoid the dramatic swings that can destabilize your autonomic nervous system and trigger POTS symptoms"
  }
}
