{
  "updated": "2026-02-12T15:40:03.405846+00:00",
  "data_range": "2026-01-30 to 2026-02-12",
  "days_analyzed": 14,
  "summary_stats": {
    "days_analyzed": 14,
    "date_range": "2026-01-30 to 2026-02-12",
    "sleep": {
      "avg_score": 82.3,
      "avg_hours": 7.6,
      "avg_deep_hours": 1.1,
      "avg_rem_hours": 1.5,
      "avg_efficiency": 85.2,
      "scores": [
        81,
        80,
        87,
        83,
        88,
        77,
        86,
        83,
        76,
        90,
        81,
        88,
        73,
        79
      ]
    },
    "readiness": {
      "avg_score": 86.6,
      "scores": [
        86,
        89,
        93,
        87,
        90,
        80,
        85,
        90,
        81,
        88,
        85,
        90,
        78,
        90
      ]
    },
    "activity": {
      "avg_score": 83.9,
      "avg_steps": 6811.8,
      "avg_calories": 575.0,
      "scores": [
        null,
        83,
        76,
        80,
        85,
        85,
        85,
        77,
        79,
        83,
        87,
        90,
        93,
        88
      ]
    },
    "heart": {
      "avg_hrv": 63.4,
      "avg_resting_hr": 46.9,
      "hrv_values": [
        null,
        72,
        70,
        69,
        55,
        76,
        61,
        60,
        50,
        72,
        52,
        56,
        69,
        62
      ]
    },
    "recovery": {
      "avg_temp_deviation": -0.1,
      "avg_breath_rate": 14.8
    },
    "workouts_count": 19
  },
  "analysis": {
    "overall_assessment": "Your health metrics show strong performance across all domains, with excellent readiness scores (86.6/100) and consistent sleep quality (82.3/100). Your autonomic nervous system appears well-regulated, evidenced by healthy HRV (63.4ms) and low resting heart rate (46.9 bpm).",
    "whats_going_well": [
      "Your readiness scores are consistently high, with 5 out of 7 recent days above 85, peaking at 93 on Feb 10th, indicating excellent recovery capacity",
      "Sleep duration is optimal at 7.6 hours average with good efficiency at 85.2%, providing crucial autonomic stability for POTS management",
      "Your HRV shows healthy variation (55-76ms in recent week) with an excellent average of 63.4ms, suggesting good autonomic nervous system balance"
    ],
    "areas_to_improve": [
      "Deep sleep is below optimal at only 1.1 hours average (should be 1.5-2 hours) - consider cooling your room to 65-68°F and avoiding screens 2 hours before bed",
      "Activity levels show high variability with steps ranging from 4,085 to 8,366 daily - aim for more consistent moderate activity around 6,000-7,000 steps to avoid POTS symptom triggers",
      "The significant HRV drop to 55ms on Feb 8th followed by a spike to 76ms suggests potential overexertion - monitor for patterns between high activity days and HRV dips"
    ],
    "pots_specific_insights": "Your low resting heart rate (46.9 bpm) and stable HRV indicate good autonomic regulation, which is crucial for POTS management. The consistency in your readiness scores suggests your body is adapting well to your current activity levels without triggering excessive orthostatic stress.",
    "focus_for_next_week": "Prioritize increasing deep sleep duration by maintaining a consistent bedtime routine and cooler sleep environment, as deeper sleep directly supports autonomic nervous system recovery essential for POTS symptom control"
  }
}
