{
  "updated": "2026-02-19T15:37:13.542005+00:00",
  "data_range": "2026-02-06 to 2026-02-19",
  "days_analyzed": 14,
  "summary_stats": {
    "days_analyzed": 14,
    "date_range": "2026-02-06 to 2026-02-19",
    "sleep": {
      "avg_score": 81.6,
      "avg_hours": 7.4,
      "avg_deep_hours": 1.2,
      "avg_rem_hours": 1.4,
      "avg_efficiency": 85.4,
      "scores": [
        83,
        80,
        81,
        79,
        72,
        80,
        86,
        81,
        80,
        87,
        83,
        88,
        77,
        86
      ]
    },
    "readiness": {
      "avg_score": 84.4,
      "scores": [
        84,
        78,
        84,
        88,
        68,
        86,
        84,
        86,
        89,
        93,
        87,
        90,
        80,
        85
      ]
    },
    "activity": {
      "avg_score": 84.8,
      "avg_steps": 7681.9,
      "avg_calories": 615.9,
      "scores": [
        null,
        93,
        80,
        86,
        88,
        86,
        89,
        87,
        83,
        76,
        80,
        85,
        85,
        85
      ]
    },
    "heart": {
      "avg_hrv": 62.6,
      "avg_resting_hr": 47.7,
      "hrv_values": [
        null,
        53,
        56,
        54,
        32,
        75,
        73,
        68,
        72,
        70,
        69,
        55,
        76,
        61
      ]
    },
    "recovery": {
      "avg_temp_deviation": -0.0,
      "avg_breath_rate": 14.8
    },
    "workouts_count": 22
  },
  "analysis": {
    "overall_assessment": "Your health metrics show strong performance with an 81.6 sleep score and 84.4 readiness score, indicating good recovery patterns. However, there's notable variability in your HRV (ranging from 32-75 ms in the last week) and sleep duration fluctuations that warrant attention for POTS management.",
    "whats_going_well": [
      "Excellent resting heart rate averaging 47.7 bpm with consistent readings (47-51 bpm range), indicating good cardiovascular conditioning for POTS management",
      "Strong overall sleep efficiency at 85.4% with good sleep scores (most days 79-86/100), providing the consistent rest crucial for autonomic nervous system regulation",
      "Maintaining active lifestyle with 22 workouts over 14 days and 84.8 activity score, demonstrating good exercise tolerance despite POTS"
    ],
    "areas_to_improve": [
      "Sleep duration inconsistency ranging from 6.2-7.4 hours - aim for more consistent 7-8 hours nightly as sleep regularity is critical for POTS symptom management",
      "HRV showing high variability (32 ms on 2/15 vs 75 ms on 2/14) - focus on stress management and recovery practices when HRV drops below 50 ms",
      "Deep sleep averaging only 1.2 hours is below optimal - consider sleep hygiene improvements like cooler room temperature and consistent bedtime routine to support autonomic recovery"
    ],
    "pots_specific_insights": "The dramatic HRV drop to 32 ms on February 15th (coinciding with your lowest readiness score of 68) suggests your autonomic nervous system was under stress, which is particularly relevant for POTS management. Your consistently low resting heart rate is positive, indicating your cardiovascular system may be adapting well to your condition management strategies.",
    "focus_for_next_week": "Prioritize consistent 7+ hour sleep duration every night and monitor how this impacts your HRV stability, as the sleep-HRV connection is crucial for POTS symptom control"
  }
}
