{
  "updated": "2026-02-07T15:35:18.438665+00:00",
  "data_range": "2026-01-25 to 2026-02-07",
  "days_analyzed": 14,
  "summary_stats": {
    "days_analyzed": 14,
    "date_range": "2026-01-25 to 2026-02-07",
    "sleep": {
      "avg_score": 81.3,
      "avg_hours": 7.7,
      "avg_deep_hours": 1.0,
      "avg_rem_hours": 1.6,
      "avg_efficiency": 83.4,
      "scores": [
        77,
        86,
        83,
        76,
        90,
        81,
        88,
        73,
        79,
        78,
        67,
        89,
        91,
        80
      ]
    },
    "readiness": {
      "avg_score": 84.4,
      "scores": [
        80,
        85,
        90,
        81,
        88,
        85,
        90,
        78,
        90,
        84,
        78,
        83,
        84,
        85
      ]
    },
    "activity": {
      "avg_score": 86.5,
      "avg_steps": 6594.7,
      "avg_calories": 561.3,
      "scores": [
        null,
        85,
        77,
        79,
        83,
        87,
        90,
        93,
        88,
        89,
        84,
        87,
        90,
        93
      ]
    },
    "heart": {
      "avg_hrv": 58.9,
      "avg_resting_hr": 47.7,
      "hrv_values": [
        null,
        61,
        60,
        50,
        72,
        52,
        56,
        69,
        62,
        55,
        53,
        54,
        63,
        59
      ]
    },
    "recovery": {
      "avg_temp_deviation": -0.0,
      "avg_breath_rate": 14.9
    },
    "workouts_count": 17
  },
  "analysis": {
    "overall_assessment": "Your metrics show strong consistency with an excellent sleep score of 81.3/100 and solid readiness at 84.4/100, indicating good autonomic recovery patterns. However, there's notable variability in your HRV (ranging from 50-72ms over the past week) and some concerning data gaps on February 7th that warrant attention.",
    "whats_going_well": [
      "Excellent sleep quality with 81.3/100 average score and consistent 7.7 hour duration - critical for POTS autonomic regulation",
      "Strong activity levels with 17 workouts completed and 6,595 average daily steps, showing good cardiovascular conditioning without overexertion",
      "Low and stable resting heart rate averaging 47.7 bpm, indicating good cardiovascular fitness which helps counter POTS symptoms"
    ],
    "areas_to_improve": [
      "Deep sleep is low at only 1.0 hour average - aim for 1.5-2 hours by maintaining cooler sleep environment and consistent bedtime routine, as deep sleep is crucial for autonomic nervous system recovery in POTS",
      "HRV shows significant day-to-day variability (50-72ms range) - focus on stress management techniques like breathing exercises and ensure adequate hydration throughout the day to stabilize autonomic function",
      "Missing data on February 7th suggests inconsistent ring wearing - maintain continuous monitoring as tracking trends is essential for POTS management and early symptom detection"
    ],
    "pots_specific_insights": "Your HRV variability and the correlation between your best sleep night (90/100 on Feb 3rd) coinciding with your highest HRV (72ms) suggests your autonomic nervous system is highly responsive to sleep quality. The consistent low resting heart rate is encouraging for POTS management, indicating your cardiovascular system is adapting well to your current routine.",
    "focus_for_next_week": "Prioritize increasing deep sleep duration by implementing a stricter sleep hygiene routine - aim for bed 30 minutes earlier and keep your bedroom temperature between 65-68°F to support the autonomic recovery that's critical for POTS symptom management."
  }
}
