{
  "updated": "2026-01-29T15:24:07.649852+00:00",
  "data_range": "2026-01-16 to 2026-01-29",
  "days_analyzed": 14,
  "summary_stats": {
    "days_analyzed": 14,
    "date_range": "2026-01-16 to 2026-01-29",
    "sleep": {
      "avg_score": 80.0,
      "avg_hours": 7.6,
      "avg_deep_hours": 1.0,
      "avg_rem_hours": 1.5,
      "avg_efficiency": 82.1,
      "scores": [
        78,
        67,
        89,
        91,
        80,
        78,
        80,
        88,
        86,
        82,
        67,
        68,
        82,
        84
      ]
    },
    "readiness": {
      "avg_score": 79.6,
      "scores": [
        84,
        78,
        83,
        84,
        85,
        80,
        82,
        82,
        83,
        81,
        37,
        77,
        87,
        92
      ]
    },
    "activity": {
      "avg_score": 89.1,
      "avg_steps": 5500.4,
      "avg_calories": 459.7,
      "scores": [
        null,
        84,
        87,
        90,
        93,
        85,
        94,
        92,
        null,
        null,
        null,
        null,
        91,
        86
      ]
    },
    "heart": {
      "avg_hrv": 51.5,
      "avg_resting_hr": 48.4,
      "hrv_values": [
        null,
        53,
        54,
        63,
        59,
        42,
        52,
        48,
        49,
        48,
        43,
        54,
        50,
        54
      ]
    },
    "recovery": {
      "avg_temp_deviation": 0.2,
      "avg_breath_rate": 15.1
    },
    "workouts_count": 12
  },
  "analysis": {
    "overall_assessment": "Your metrics show strong consistency with good sleep scores averaging 80/100 and excellent readiness scores at 79.6/100, indicating your body is managing recovery well. However, your deep sleep is significantly low at just 1.0 hour average, and there's notable HRV variability (ranging from 42-63ms) that warrants attention for optimal POTS management.",
    "whats_going_well": [
      "Excellent sleep duration consistency at 7.6 hours average with your best nights (Jan 26-27) reaching 8.3 hours and scoring 89-91/100",
      "Strong activity levels with 89.1/100 average score and 12 workouts completed, showing you're maintaining good physical conditioning despite POTS",
      "Your resting heart rate remains impressively stable at 48.4 bpm average, indicating good cardiovascular fitness for POTS management"
    ],
    "areas_to_improve": [
      "Deep sleep is critically low at 1.0 hour average (healthy range is 1.5-2+ hours) - focus on sleep hygiene, cooler room temperature, and avoiding screens 2 hours before bed",
      "HRV shows concerning volatility, dropping to 42ms on Jan 24 then jumping to 63ms on Jan 26 - implement consistent stress management and ensure adequate hydration throughout the day",
      "Sleep efficiency at 82.1% indicates frequent wake-ups - consider a consistent pre-sleep routine and evaluate bedroom environment for disruptions"
    ],
    "pots_specific_insights": "Your stable low resting heart rate is excellent for POTS, but the HRV fluctuations and insufficient deep sleep could impact your autonomic nervous system regulation. The consistent sleep duration is helping maintain your good readiness scores, which is crucial for POTS symptom management.",
    "focus_for_next_week": "Prioritize increasing deep sleep by implementing a strict sleep schedule with bedtime 30 minutes earlier and a cool, dark sleep environment to support autonomic recovery"
  }
}
