{
  "updated": "2026-02-03T15:38:08.773901+00:00",
  "data_range": "2026-01-21 to 2026-02-03",
  "days_analyzed": 14,
  "summary_stats": {
    "days_analyzed": 14,
    "date_range": "2026-01-21 to 2026-02-03",
    "sleep": {
      "avg_score": 82.0,
      "avg_hours": 7.6,
      "avg_deep_hours": 1.0,
      "avg_rem_hours": 1.6,
      "avg_efficiency": 82.2,
      "scores": [
        90,
        81,
        88,
        73,
        79,
        78,
        67,
        89,
        91,
        80,
        78,
        80,
        88,
        86
      ]
    },
    "readiness": {
      "avg_score": 83.7,
      "scores": [
        88,
        85,
        90,
        78,
        90,
        84,
        78,
        83,
        84,
        85,
        80,
        82,
        82,
        83
      ]
    },
    "activity": {
      "avg_score": 89.3,
      "avg_steps": 6074.2,
      "avg_calories": 519.8,
      "scores": [
        null,
        87,
        90,
        93,
        88,
        89,
        84,
        87,
        90,
        93,
        85,
        94,
        92,
        null
      ]
    },
    "heart": {
      "avg_hrv": 54.9,
      "avg_resting_hr": 47.6,
      "hrv_values": [
        null,
        52,
        56,
        69,
        62,
        55,
        53,
        54,
        63,
        59,
        42,
        52,
        48,
        49
      ]
    },
    "recovery": {
      "avg_temp_deviation": 0.0,
      "avg_breath_rate": 15.0
    },
    "workouts_count": 16
  },
  "analysis": {
    "overall_assessment": "Your metrics show strong overall health with an excellent average sleep score of 82/100 and solid readiness (83.7/100), indicating good recovery patterns. However, there's notable variability in your sleep quality and some concerning gaps in recent data tracking that could impact POTS management.",
    "whats_going_well": [
      "Excellent sleep efficiency at 82.2% with good duration averaging 7.6 hours, which is crucial for autonomic nervous system regulation with POTS",
      "Strong HRV average of 54.9ms and low resting heart rate of 47.6 bpm suggest good cardiovascular fitness and autonomic function",
      "Consistent activity levels with 16 workouts over 14 days and solid activity scores (89.3 average) while maintaining good readiness scores"
    ],
    "areas_to_improve": [
      "Deep sleep is significantly low at only 1.0 hour average - aim for 1.5-2 hours by maintaining cooler sleep environment and consistent bedtime routine, especially important for POTS recovery",
      "Sleep quality shows concerning volatility (ranging from 67-90/100) with Jan 28th and 31st showing poor scores - identify triggers like stress, caffeine, or activity timing that may be disrupting sleep",
      "Step count variability is extreme (2,785 to 9,324 steps) which can destabilize POTS symptoms - aim for more consistent daily activity levels between 5,000-7,000 steps"
    ],
    "pots_specific_insights": "Your HRV fluctuations (52-69ms range) and sleep variability suggest your autonomic nervous system is experiencing some instability, which directly impacts POTS symptom management. The combination of low deep sleep and inconsistent activity patterns could be contributing to autonomic dysfunction flares.",
    "focus_for_next_week": "Establish a consistent bedtime routine and aim for the same sleep/wake times daily to improve deep sleep duration and stabilize your autonomic nervous system function."
  }
}
