{
  "updated": "2026-02-27T15:28:38.727102+00:00",
  "data_range": "2026-02-14 to 2026-02-27",
  "days_analyzed": 14,
  "summary_stats": {
    "days_analyzed": 14,
    "date_range": "2026-02-14 to 2026-02-27",
    "sleep": {
      "avg_score": 82.2,
      "avg_hours": 7.3,
      "avg_deep_hours": 1.2,
      "avg_rem_hours": 1.5,
      "avg_efficiency": 84.3,
      "scores": [
        81,
        86,
        84,
        87,
        87,
        82,
        82,
        87,
        83,
        80,
        81,
        79,
        72,
        80
      ]
    },
    "readiness": {
      "avg_score": 84.4,
      "scores": [
        85,
        93,
        87,
        88,
        87,
        85,
        80,
        89,
        84,
        78,
        84,
        88,
        68,
        86
      ]
    },
    "activity": {
      "avg_score": 87.1,
      "avg_steps": 7398.2,
      "avg_calories": 558.0,
      "scores": [
        null,
        90,
        83,
        85,
        80,
        92,
        90,
        91,
        88,
        93,
        80,
        86,
        88,
        86
      ]
    },
    "heart": {
      "avg_hrv": 60.8,
      "avg_resting_hr": 48.0,
      "hrv_values": [
        null,
        83,
        56,
        62,
        64,
        62,
        69,
        61,
        64,
        53,
        56,
        54,
        32,
        75
      ]
    },
    "recovery": {
      "avg_temp_deviation": -0.0,
      "avg_breath_rate": 14.8
    },
    "workouts_count": 16
  },
  "analysis": {
    "overall_assessment": "Your metrics show strong overall health with excellent sleep scores (82.2 average) and high readiness (84.4 average), indicating good recovery capacity. However, there's concerning variability in your HRV (ranging from 56-83 ms in recent days) and activity levels (steps varying dramatically from 1,966 to 11,206), which could be impacting your POTS management.",
    "whats_going_well": [
      "Consistently strong sleep quality with an average score of 82.2/100 and good sleep duration averaging 7.3 hours, providing crucial autonomic nervous system recovery time for POTS management",
      "Excellent readiness scores averaging 84.4/100 with recent days showing 85-93, indicating your body is generally recovering well between activities",
      "Your average resting heart rate of 48 bpm is well-controlled, with recent readings staying between 45-53 bpm, suggesting good cardiovascular conditioning despite POTS"
    ],
    "areas_to_improve": [
      "Deep sleep is inconsistent and sometimes low (0.9-1.0 hours on Feb 21, 23-25 vs 1.8 hours on Feb 22), focus on consistent bedtime routines and sleep hygiene to stabilize this crucial recovery phase",
      "Activity levels are extremely variable with steps ranging from 1,966 to 11,206 daily - aim for more consistent moderate activity (4,000-6,000 steps) to avoid POTS flare-ups from overexertion",
      "HRV shows significant fluctuations (56 ms on Feb 25 vs 83 ms on Feb 26), suggesting autonomic instability - prioritize stress management and consistent sleep/wake times to stabilize nervous system function"
    ],
    "pots_specific_insights": "The dramatic swings in HRV and activity levels suggest your autonomic nervous system is working hard to maintain balance, which is typical with POTS. Your strong sleep scores and controlled resting heart rate indicate you're managing the condition well overall, but the variability suggests room for optimization.",
    "focus_for_next_week": "Aim for consistent daily step counts between 4,000-6,000 to avoid the dramatic activity swings that may be contributing to your HRV variability and potentially triggering POTS symptoms"
  }
}
