{
  "updated": "2026-02-11T15:48:13.216202+00:00",
  "data_range": "2026-01-29 to 2026-02-11",
  "days_analyzed": 14,
  "summary_stats": {
    "days_analyzed": 14,
    "date_range": "2026-01-29 to 2026-02-11",
    "sleep": {
      "avg_score": 82.1,
      "avg_hours": 7.6,
      "avg_deep_hours": 1.1,
      "avg_rem_hours": 1.5,
      "avg_efficiency": 84.9,
      "scores": [
        81,
        87,
        83,
        88,
        77,
        86,
        83,
        76,
        90,
        81,
        88,
        73,
        79,
        78
      ]
    },
    "readiness": {
      "avg_score": 86.4,
      "scores": [
        89,
        93,
        87,
        90,
        80,
        85,
        90,
        81,
        88,
        85,
        90,
        78,
        90,
        84
      ]
    },
    "activity": {
      "avg_score": 84.4,
      "avg_steps": 6617.5,
      "avg_calories": 540.8,
      "scores": [
        null,
        76,
        80,
        85,
        85,
        85,
        77,
        79,
        83,
        87,
        90,
        93,
        88,
        89
      ]
    },
    "heart": {
      "avg_hrv": 62.1,
      "avg_resting_hr": 47.0,
      "hrv_values": [
        null,
        70,
        69,
        55,
        76,
        61,
        60,
        50,
        72,
        52,
        56,
        69,
        62,
        55
      ]
    },
    "recovery": {
      "avg_temp_deviation": -0.1,
      "avg_breath_rate": 14.9
    },
    "workouts_count": 17
  },
  "analysis": {
    "overall_assessment": "Your metrics show strong overall health with excellent readiness (86.4) and activity scores (84.4), indicating good autonomic recovery despite POTS. However, the significant HRV fluctuations (ranging from 55-76 ms in recent days) and consistently low deep sleep (averaging only 1.1 hours) warrant attention for optimal POTS management.",
    "whats_going_well": [
      "Excellent resting heart rate control with an average of 47 bpm, showing your cardiovascular system is responding well to your management strategies",
      "Strong sleep efficiency at 84.9% indicates you're falling asleep well and staying asleep, which is crucial for autonomic nervous system regulation with POTS",
      "Consistent readiness scores above 85 on most days (5 out of 7 recent days at 85+) suggests your body is recovering well between activities"
    ],
    "areas_to_improve": [
      "Deep sleep averaging only 1.1 hours is below optimal (1.5-2 hours recommended) - consider earlier bedtimes, cooler room temperature, or magnesium supplementation to enhance restorative sleep",
      "HRV shows high volatility (76 on Feb 7th dropping to 55 on Feb 8th) suggesting autonomic instability - focus on consistent sleep/wake times and stress management techniques",
      "Activity levels vary significantly (4085-8366 steps) which can trigger POTS symptoms - aim for more consistent daily movement around 6000 steps rather than large fluctuations"
    ],
    "pots_specific_insights": "Your low resting heart rate (47 bpm) and good readiness scores suggest your POTS management is effective, but the HRV variability indicates your autonomic nervous system is still experiencing fluctuations that could correlate with symptom severity.",
    "focus_for_next_week": "Prioritize consistent bedtime routine to increase deep sleep duration, aiming for 1.5+ hours per night to better support autonomic nervous system stability"
  }
}
